analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32690/Include/gcr_regs.h
#define MXC_F_GCR_ECCERR_RAM3_POS                      3 /**< ECCERR_RAM3 Position */
#define MXC_F_GCR_ECCERR_RAM3                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_RAM3_POS)) /**< ECCERR_RAM3 Mask */

#define MXC_F_GCR_ECCERR_RAM4_POS                      4 /**< ECCERR_RAM4 Position */
#define MXC_F_GCR_ECCERR_RAM4                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_RAM4_POS)) /**< ECCERR_RAM4 Mask */

#define MXC_F_GCR_ECCERR_RAM5_POS                      5 /**< ECCERR_RAM5 Position */
#define MXC_F_GCR_ECCERR_RAM5                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_RAM5_POS)) /**< ECCERR_RAM5 Mask */

#define MXC_F_GCR_ECCERR_RAM6_POS                      6 /**< ECCERR_RAM6 Position */
#define MXC_F_GCR_ECCERR_RAM6                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_RAM6_POS)) /**< ECCERR_RAM6 Mask */

#define MXC_F_GCR_ECCERR_ICACHE0_POS                   8 /**< ECCERR_ICACHE0 Position */
#define MXC_F_GCR_ECCERR_ICACHE0                       ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_ICACHE0_POS)) /**< ECCERR_ICACHE0 Mask */

#define MXC_F_GCR_ECCERR_ICACHEXIP_POS                 10 /**< ECCERR_ICACHEXIP Position */
#define MXC_F_GCR_ECCERR_ICACHEXIP                     ((uint32_t)(0x1UL << MXC_F_GCR_ECCERR_ICACHEXIP_POS)) /**< ECCERR_ICACHEXIP Mask */

/**@} end of group GCR_ECCERR_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCCED GCR_ECCCED
 * @brief    ECC Not Double Error Detect Register
 * @{
 */
#define MXC_F_GCR_ECCCED_RAM0_POS                      0 /**< ECCCED_RAM0 Position */
#define MXC_F_GCR_ECCCED_RAM0                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM0_POS)) /**< ECCCED_RAM0 Mask */

#define MXC_F_GCR_ECCCED_RAM1_POS                      1 /**< ECCCED_RAM1 Position */
#define MXC_F_GCR_ECCCED_RAM1                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM1_POS)) /**< ECCCED_RAM1 Mask */

#define MXC_F_GCR_ECCCED_RAM2_POS                      2 /**< ECCCED_RAM2 Position */
#define MXC_F_GCR_ECCCED_RAM2                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM2_POS)) /**< ECCCED_RAM2 Mask */

#define MXC_F_GCR_ECCCED_RAM3_POS                      3 /**< ECCCED_RAM3 Position */
#define MXC_F_GCR_ECCCED_RAM3                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM3_POS)) /**< ECCCED_RAM3 Mask */

#define MXC_F_GCR_ECCCED_RAM4_POS                      4 /**< ECCCED_RAM4 Position */
#define MXC_F_GCR_ECCCED_RAM4                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM4_POS)) /**< ECCCED_RAM4 Mask */

#define MXC_F_GCR_ECCCED_RAM5_POS                      5 /**< ECCCED_RAM5 Position */
#define MXC_F_GCR_ECCCED_RAM5                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM5_POS)) /**< ECCCED_RAM5 Mask */

#define MXC_F_GCR_ECCCED_RAM6_POS                      6 /**< ECCCED_RAM6 Position */
#define MXC_F_GCR_ECCCED_RAM6                          ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_RAM6_POS)) /**< ECCCED_RAM6 Mask */

#define MXC_F_GCR_ECCCED_ICACHE0_POS                   8 /**< ECCCED_ICACHE0 Position */
#define MXC_F_GCR_ECCCED_ICACHE0                       ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_ICACHE0_POS)) /**< ECCCED_ICACHE0 Mask */

#define MXC_F_GCR_ECCCED_ICACHEXIP_POS                 10 /**< ECCCED_ICACHEXIP Position */
#define MXC_F_GCR_ECCCED_ICACHEXIP                     ((uint32_t)(0x1UL << MXC_F_GCR_ECCCED_ICACHEXIP_POS)) /**< ECCCED_ICACHEXIP Mask */

/**@} end of group GCR_ECCCED_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCIE GCR_ECCIE
 * @brief    ECC IRQ Enable Register
 * @{
 */
#define MXC_F_GCR_ECCIE_RAM0_POS                       0 /**< ECCIE_RAM0 Position */
#define MXC_F_GCR_ECCIE_RAM0                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM0_POS)) /**< ECCIE_RAM0 Mask */

#define MXC_F_GCR_ECCIE_RAM1_POS                       1 /**< ECCIE_RAM1 Position */
#define MXC_F_GCR_ECCIE_RAM1                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM1_POS)) /**< ECCIE_RAM1 Mask */

#define MXC_F_GCR_ECCIE_RAM2_POS                       2 /**< ECCIE_RAM2 Position */
#define MXC_F_GCR_ECCIE_RAM2                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM2_POS)) /**< ECCIE_RAM2 Mask */

#define MXC_F_GCR_ECCIE_RAM3_POS                       3 /**< ECCIE_RAM3 Position */
#define MXC_F_GCR_ECCIE_RAM3                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM3_POS)) /**< ECCIE_RAM3 Mask */

#define MXC_F_GCR_ECCIE_RAM4_POS                       4 /**< ECCIE_RAM4 Position */
#define MXC_F_GCR_ECCIE_RAM4                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM4_POS)) /**< ECCIE_RAM4 Mask */

#define MXC_F_GCR_ECCIE_RAM5_POS                       5 /**< ECCIE_RAM5 Position */
#define MXC_F_GCR_ECCIE_RAM5                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM5_POS)) /**< ECCIE_RAM5 Mask */

#define MXC_F_GCR_ECCIE_RAM6_POS                       6 /**< ECCIE_RAM6 Position */
#define MXC_F_GCR_ECCIE_RAM6                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_RAM6_POS)) /**< ECCIE_RAM6 Mask */

#define MXC_F_GCR_ECCIE_ICACHE0_POS                    8 /**< ECCIE_ICACHE0 Position */
#define MXC_F_GCR_ECCIE_ICACHE0                        ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_ICACHE0_POS)) /**< ECCIE_ICACHE0 Mask */

#define MXC_F_GCR_ECCIE_ICACHEXIP_POS                  10 /**< ECCIE_ICACHEXIP Position */
#define MXC_F_GCR_ECCIE_ICACHEXIP                      ((uint32_t)(0x1UL << MXC_F_GCR_ECCIE_ICACHEXIP_POS)) /**< ECCIE_ICACHEXIP Mask */

/**@} end of group GCR_ECCIE_Register */

/**
 * @ingroup  gcr_registers
 * @defgroup GCR_ECCADDR GCR_ECCADDR
 * @brief    ECC Error Address Register
 * @{
 */
#define MXC_F_GCR_ECCADDR_DADDR_POS                    0 /**< ECCADDR_DADDR Position */
#define MXC_F_GCR_ECCADDR_DADDR                        ((uint32_t)(0x3FFFUL << MXC_F_GCR_ECCADDR_DADDR_POS)) /**< ECCADDR_DADDR Mask */

#define MXC_F_GCR_ECCADDR_DB_POS                       14 /**< ECCADDR_DB Position */
#define MXC_F_GCR_ECCADDR_DB                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_DB_POS)) /**< ECCADDR_DB Mask */

#define MXC_F_GCR_ECCADDR_DE_POS                       15 /**< ECCADDR_DE Position */
#define MXC_F_GCR_ECCADDR_DE                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_DE_POS)) /**< ECCADDR_DE Mask */

#define MXC_F_GCR_ECCADDR_TADDR_POS                    16 /**< ECCADDR_TADDR Position */
#define MXC_F_GCR_ECCADDR_TADDR                        ((uint32_t)(0x3FFFUL << MXC_F_GCR_ECCADDR_TADDR_POS)) /**< ECCADDR_TADDR Mask */

#define MXC_F_GCR_ECCADDR_TB_POS                       30 /**< ECCADDR_TB Position */
#define MXC_F_GCR_ECCADDR_TB                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_TB_POS)) /**< ECCADDR_TB Mask */

#define MXC_F_GCR_ECCADDR_TE_POS                       31 /**< ECCADDR_TE Position */
#define MXC_F_GCR_ECCADDR_TE                           ((uint32_t)(0x1UL << MXC_F_GCR_ECCADDR_TE_POS)) /**< ECCADDR_TE Mask */

